/*
  -- FD: wiki:wiki:80_class.sql / 2 --

  PGWS. APP. Классы и акции

*/
/* ------------------------------------------------------------------------- */
\qecho '-- FD: wiki:wiki:80_class.sql / 8 --'

/* ------------------------------------------------------------------------- */
INSERT INTO class (id, up_id, id_count, is_ext, sort, code, name) VALUES
  (5, NULL, 1,        FALSE, '5', 'wiki',        'Вики')
;

/* ------------------------------------------------------------------------- */

INSERT INTO class_status (class_id, id, sort, name) VALUES
  (5, 1, '51', 'Черновик')
, (5, 2, '52', 'Готова к публикации')
, (5, 3, '53', 'Опубликована')
, (5, 4, '54', 'Архив')
, (5, 5, '55', 'Удалена')
;

/* ------------------------------------------------------------------------- */
INSERT INTO class_action (class_id, id, sort, name) VALUES
  (5, 1,  '51', 'Публичное чтение')
, (5, 2,  '52', 'Авторизованное чтение')
, (5, 3,  '53', 'Изменение атрибутов')
, (5, 4,  '54', 'Редактирование')

;

/* ------------------------------------------------------------------------- */
\qecho '-- FD: wiki:wiki:80_class.sql / 35 --'
